#include <stdio.h>
int main(void)
{
    printf("-------------------------\n");
    printf("   수강생 정보 확인서\n");
    printf("-------------------------\n");
    printf("이름:%s\n", "백정윤"); // 문자열
    printf("나이:%d\n", 26); // 정수
    printf("전화:010-%d-%d\n", 6489, 7505); // 문자열
    printf("주소:%s\n", "경북 구미시 송동로 105, 108동 808호"); // 문자열
    printf("키:%.1fcm\n", 180.2); // 실수
    printf("몸무게:%.1fkg\n", 78.5); // 실수
    printf("혈액형:%c형\n", 'O'); // 문자
    printf("-------------------------\n");
}