
public class repeat {
	public static void main(String[] args) {
		
		
		// 조건문 :: if - else if-else문, switch		
		// 조건문 1을 만족하면? -> if 내용만 수행하고 끝남. 
		// 조건문 1을 만족하지 못하면? -> else if 또는 else로 토스됨. 
//		if(조건문1) {			// "조건문1"을 만족하면,
		  // 여기에 있는 내용을 수행하라. 
//		}
//		else if (조건문2) { // 위 조건문을 만족하지 못하고, "조건문2"를 만족할 때 
		    // 여기에 있는 내용을 수행하라. 
//		}
//		else {  // 위 조건문을 모두 만족하지 못하였다면,
		  // 이거라도 수행하라.  
//		  ctrl+슬래쉬 누르면 주석 키고 끌 수 있음.
//		}
		
		// 반복문 :: (조건을 만족한다는 전제 하) 동일한 명령문을 반복하는 구문 
		// for문, while문, do-while문 웬만해선 for문과 while문을 사용함. 
		     
//		while(조건문) {
//		   조건문 만족할 시, 반복할 명령문 
//	    }
//		for( ; 조건문; ) 이렇게 사용해도 지장 없다. 조건문 판별 사전작업 선언, 후처리를 생략 가능함
//		for(조건문 판별 이전 사전작업; 조건문; 루프완료시 후처리) {       
//			반복할 명령문 
//		}
	}
}

